app/views/pages/eleve.html.erb

SELECT  "exams".* FROM "exams" WHERE "exams"."id" = $1 ORDER BY "exams"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 ORDER BY "subjects"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 ORDER BY "teachers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <tbody>
  <% @epreuve = Exam.where(id: note.exam_id).first %>
  <% @mat = Subject.where(id: @epreuve.subject_id).first %>
  <% @prof = Teacher.where(id: @mat.teacher_id).first %>