app/views/pages/note.html.erb

SELECT  "studients".* FROM "studients" WHERE "studients"."id" = $1 ORDER BY "studients"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          <tbody>
          <% @eleve = Studient.where(id: notes.studient_id).first %>