app/controllers/pages_controller.rb

SELECT "teachers".* FROM "teachers" WHERE "teachers"."role" = $1  [["role", "attente"]]
---
  def admin
    @teacher_attente = Teacher.where(role: "attente")

SELECT "subjects".* FROM "subjects" WHERE "subjects"."teacher_id" = $1  [["teacher_id", 0]]
---
  def prof
    @prof = set_current_teacher
    @matiere = Subject.where(teacher_id: @prof.id)

SELECT "exams".* FROM "exams" WHERE "exams"."subject_id" = $1  [["subject_id", 1]]
---
  def examprof
    @prof = set_current_teacher
    @matiere = set_current_subject
    @epreuve = Exam.where(subject_id: @matiere.id)

SELECT "marks".* FROM "marks" WHERE "marks"."exam_id" = $1  [["exam_id", 1]]
---
  def note
    @prof = set_current_teacher
    @matiere = set_current_subject
    @epreuve = set_current_exam
    @mark = Mark.where(exam_id: @epreuve.id)

SELECT "marks".* FROM "marks" WHERE "marks"."studient_id" = $1  [["studient_id", 1]]
---
  def eleve
    @eleve = set_current_studient
    @mark = Mark.where(studient_id: @eleve.id)

SELECT  "administrateurs".* FROM "administrateurs" WHERE "administrateurs"."nom" = $1 AND "administrateurs"."email" = $2 AND "administrateurs"."password" = $3 ORDER BY "administrateurs"."id" ASC LIMIT $4  [["nom", "admin"], ["email", "hanna.benjedidia@gmail.com"], ["password", "admin"], ["LIMIT", 1]]
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."surname" = $1 AND "teachers"."email" = $2 AND "teachers"."password" = $3 AND "teachers"."role" = $4 ORDER BY "teachers"."id" ASC LIMIT $5  [["surname", "D"], ["email", "d@d"], ["password", "d"], ["role", "accepte"], ["LIMIT", 1]]
SELECT  "studients".* FROM "studients" WHERE "studients"."surname" = $1 AND "studients"."email" = $2 AND "studients"."password" = $3 ORDER BY "studients"."id" ASC LIMIT $4  [["surname", "Nom"], ["email", "eleve@eleve"], ["password", "1"], ["LIMIT", 1]]
---
  def connexion
    if (params[:nom] != '') && (params[:email] != '') && (params[:password] != '')
      @admin = Administrateur.where(nom: params[:nom], email: params[:email], password: params[:password]).first
      @prof = Teacher.where(surname: params[:nom], email: params[:email], password: params[:password], role: "accepte").first
      @eleve = Studient.where(surname: params[:nom], email: params[:email], password: params[:password]).first

SELECT "studients".* FROM "studients"
SELECT "teachers".* FROM "teachers"
INSERT INTO "teachers" ("surname", "name", "password", "email", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["surname", "a"], ["name", "a"], ["password", "a"], ["email", "a@a"], ["role", "attente"], ["created_at", 2017-05-18 16:54:53 UTC], ["updated_at", 2017-05-18 16:54:53 UTC]]
---
  def inscrire
    if (params[:nom] != '') && (params[:email] != '') && (params[:password] != '') && (params[:prenom] != '')
      @eleve = Studient.all
      compteur = 0
      @eleve.each do |mail|
        if params[:email] == mail.email
          compteur += 1
        end
      end
      if compteur == 0
        @prof = Teacher.all
        plus = 0
        @prof.each do |mailp|
          if params[:email] == mailp.email
            plus += 1
          end
        end
        if plus == 0
          Teacher.create(surname: params[:nom], name: params[:prenom], email: params[:email], password: params[:password], role: "attente")

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "teachers" SET "role" = $1, "updated_at" = $2 WHERE "teachers"."id" = $3  [["role", "accepte"], ["updated_at", 2017-05-19 09:22:56 UTC], ["id", 1]]
---
  def accepter
    Teacher.find(params[:id]).update(role: "accepte")

DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 4]]
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def refuser
    Teacher.find(params[:id]).destroy

DELETE FROM "marks" WHERE "marks"."id" = $1  [["id", 1]]
SELECT  "marks".* FROM "marks" WHERE "marks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def suppnote
    Mark.find(params[:note]).destroy

SELECT  "exams".* FROM "exams" WHERE "exams"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "marks".* FROM "marks" WHERE "marks"."exam_id" = $1  [["exam_id", 5]]
SELECT  "marks".* FROM "marks" WHERE "marks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "marks" WHERE "marks"."id" = $1  [["id", 8]]
DELETE FROM "exams" WHERE "exams"."id" = $1  [["id", 5]]
---
  def suppepp
    @ep = Exam.find(params[:ep])
    @note = Mark.where(exam_id: @ep.id)
    @note.each do |sup|
      Mark.find(sup.id).destroy
    end
    Exam.find(params[:ep]).destroy

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "exams".* FROM "exams" WHERE "exams"."subject_id" = $1  [["subject_id", 2]]
SELECT  "exams".* FROM "exams" WHERE "exams"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "marks".* FROM "marks" WHERE "marks"."exam_id" = $1  [["exam_id", 4]]
SELECT  "marks".* FROM "marks" WHERE "marks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "marks" WHERE "marks"."id" = $1  [["id", 4]]
DELETE FROM "exams" WHERE "exams"."id" = $1  [["id", 4]]
DELETE FROM "subjects" WHERE "subjects"."id" = $1  [["id", 2]]
---
  def suppmat
    @mat = Subject.find(params[:mat])
    @ep = Exam.where(subject_id: @mat.id)
    @ep.each do |supep|
      @note = Mark.where(exam_id: supep.id)
      @note.each do |supnote|
        Mark.find(supnote.id).destroy
      end
      Exam.find(supep.id).destroy
    end
    Subject.find(params[:mat]).destroy

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 ORDER BY "teachers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_current_teacher
    if session[:id_teacher]
      @current_teacher = Teacher.find(session[:id_teacher])

SELECT  "studients".* FROM "studients" WHERE "studients"."id" = $1 ORDER BY "studients"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_current_studient
    if session[:id_studient]
      @current_studient = Studient.find(session[:id_studient])

INSERT INTO "subjects" ("title", "begin", "end", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "math"], ["begin", 2017-09-01 00:00:00 UTC], ["end", 2018-05-01 00:00:00 UTC], ["teacher_id", 1], ["created_at", 2017-05-19 16:26:21 UTC], ["updated_at", 2017-05-19 16:26:21 UTC]]
---
  def ajouter
    if (params[:matiere] != '') && (params[:debut] != '') && (params[:fin] != '')
      Subject.create(title: params[:matiere], begin: params[:debut], end: params[:fin], teacher_id: params[:id])

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 ORDER BY "subjects"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def examen
    @matiere = Subject.where(id: params[:id_mat]).first

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 ORDER BY "subjects"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_current_subject
    if session[:id_subject]
      @current_subject = Subject.find(session[:id_subject])

INSERT INTO "exams" ("title", "date", "subject_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Arithmétique"], ["date", 2017-12-03 00:00:00 UTC], ["subject_id", 1], ["created_at", 2017-05-20 11:35:33 UTC], ["updated_at", 2017-05-20 11:35:33 UTC]]
---
  def ajouterexam
    if (params[:epreuve] != '') && (params[:date] != '')
      Exam.create(title: params[:epreuve], date: params[:date], subject_id: params[:matiere])

SELECT  "exams".* FROM "exams" WHERE "exams"."id" = $1 ORDER BY "exams"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def voirnote
    @epreuve = Exam.where(id: params[:id_epreuve]).first

SELECT  "exams".* FROM "exams" WHERE "exams"."id" = $1 ORDER BY "exams"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_current_exam
    if session[:id_exam]
      @current_exam = Exam.find(session[:id_exam])

SELECT  "studients".* FROM "studients" WHERE "studients"."surname" = $1 AND "studients"."name" = $2 ORDER BY "studients"."id" ASC LIMIT $3  [["surname", "Nom"], ["name", "Prenom"], ["LIMIT", 1]]
SELECT "marks".* FROM "marks" WHERE "marks"."exam_id" = $1  [["exam_id", 1]]
INSERT INTO "marks" ("mark", "exam_id", "studient_id", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["mark", 18.0], ["exam_id", 1], ["studient_id", 1], ["teacher_id", 1], ["created_at", 2017-05-20 15:42:28 UTC], ["updated_at", 2017-05-20 15:42:28 UTC]]
---
  def ajoutnote
    if ((params[:nom] != '') && (params[:prenom] != '') && (params[:note] != '')) then
      @eleve = Studient.where(surname: params[:nom], name: params[:prenom]).first
      if @eleve then
        @note = Mark.where(exam_id: params[:exam])
        compteur = 0
        @note.each do |note_eleve|
          if note_eleve.studient_id == @eleve.id
            compteur +=1
          end
        end
        if compteur == 0
          Mark.create(mark: params[:note], exam_id: params[:exam], studient_id: @eleve.id, teacher_id: params[:prof])

SELECT "studients".* FROM "studients"
INSERT INTO "studients" ("surname", "name", "password", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["surname", "y"], ["name", "y"], ["password", "ljpKLhXJ"], ["email", "y@y"], ["created_at", 2017-05-21 19:13:45 UTC], ["updated_at", 2017-05-21 19:13:45 UTC]]
---
  def inviter
    if (params[:nom] != '') && (params[:email] != '') && (params[:prenom] != '')
      @eleve = Studient.all
      compteur = 0
      @eleve.each do |el|
        if el.email == params[:email]
          compteur += 1
        end
      end
      if compteur == 0
        password = ""
        8.times{password  << ((rand(2)==1?65:97) + rand(25)).chr}
        @nveleve = Studient.create(surname: params[:nom], name: params[:prenom], email: params[:email], password: password)